{
    "Name": "Shaheriar Malik",
    "Description": "A creative and driven Computer Engineering MS graduate with a strong background in Intelligent Transportation Systems, Deep Learning, Autonomous Embedded Systems, and Robotics, but also likes to spend time making art and music. Eager to work in a healthy team based environment that is equally as passionate and excited about building and creating new ways for people to connect with technology, and each other.",
    "Image": "https://avatars.githubusercontent.com/u/49822364?v=4",
    "Education":[
        {
            "Name":"University of California, Riverside",
            "Degree":"Masters of Science in Computer Engineering",
            "From":"Fall 2022",
            "To":"Spring 2023",
            "GPA":"3.70"
        },
        {
            "Name":"University of California, Riverside",
            "Degree":"Bachelors of Science in Computer Engineering",
            "From":"Fall 2019",
            "To":"Winter 2022",
            "GPA":"3.75"
        },
        {
            "Name":"Cerritos College",
            "Degree":"Associates of Arts in Engineering",
            "From":"Fall 2016",
            "To":"Spring 2019",
            "GPA":"3.52"
        }
    ],
    "Experience":[
        {
            "Name":"CE-CERT",
            "Title":"Research Scientist",
            "From":"Mar 2023",
            "To":"Jun 2023",
            "Description":[
                "Exploring the capabilities of the Cohda Wireless MK6 OBU for Vehicle-to-Anything communication.",
                "Successfully establishing communication between two OBUs to exchange basic safety messages.",
                "Developed the necessary software for communication with under 20 ms latency using C++."
            ]
        },
        {
            "Name":"UC Riverside",
            "Title":"Teacher Assistant",
            "From":"Jan 2023",
            "To":"Jun 2023",
            "Description":[
                "Teaching Assistant (TA) for CS 010A - Introduction to Computer Science for Science, Mathematics, and Engineering I for Winter and Spring 2023.",
                "Preparing and conducting weekly lab sessions for a class of 100 students to provide supplementary instruction and guide students in their lab assignments.",
                "Holding office hours to assist students with coursework that includes the foundations of programming and an introduction to the C++ programming language.",
                "Assisting the professor in logistical tasks such as proctoring examinations, grading, and answering student questions and concerns on the online class forum.",
                "Received an average 92% evaluation rating from students."
            ]
        },
        {
            "Name":"Computational Imaging and Machine Intelligence Lab",
            "Title":"Research Assistant",
            "From":"Feb 2021",
            "To":"Jun 2021",
            "Description":[
                "Investigating the utilization of different PPG/ECG biosensors to take cardiovascular measurements.",
                "Analyzing the collected experimental medical data using Python and MATLAB.",
                "Assisting in conducting experiments to explore different measurement techniques for optimization."
            ]
        },
        {
            "Name":"MindTApp",
            "Title":"Frontend Developer",
            "From":"August 2020",
            "To":"October 2020",
            "Description":[
                "Developing and designing the UI for the iOS & Android applications using the Flutter SDK.",
                "Dynamically presenting data fetched from the Google Firebase cloud server.",
                "Coordinating with the Backend team to structure the app in the most efficient way possible.",
                "Assured the quality and compatibility of the UI was consistent on every device.",
                "Assisted in successfully launching the application on the App Store and Play Store"
            ]
        }
    ],
    "Skills":{
        "Languages":[
            {    
                "Name":"C++",
                "Proficiency":1
            },
            {    
                "Name":"C",
                "Proficiency":0.9
            },
            {    
                "Name":"Python",
                "Proficiency":1
            },
            {    
                "Name":"Java",
                "Proficiency":0.6
            }
        ],
        "Technology":[
            {
                "Name":"Git",
                "Proficiency":0.8
            },
            {
                "Name":"OpenCV",
                "Proficiency":0.7
            },
            {
                "Name":"PSpice",
                "Proficiency":0.8
            },
            {
                "Name":"MATLAB",
                "Proficiency":0.7
            },
            {
                "Name":"Flutter",
                "Proficiency":1
            },
            {
                "Name":"Google Firebase",
                "Proficiency":0.8
            }
        ]
    }
}
